##################################################
# ヒストリサイズ
##################################################
export HISTFILE=$HOME/.zsh_history
export HISTSIZE=1000
export SAVEHIST=1500


##################################################
# エディタ設定
##################################################
export EDITOR="emacs -nw"


##################################################
# キーバインディング
##################################################
# とりあえず、thinkpadだけ
# その他は様子見ながら対応
[ `dmesg | grep thinkpad | wc -l` -gt 0 -a -e $HOME/.Xmodmaprc ] && xmodmap $HOME/.Xmodmaprc


##################################################
# IBUSの設定
##################################################
export GTK_IM_MODULE=ibus
export XMODIFIERS=@im=ibus
export QT_IM_MODULE=ibus
ibus-daemon -d --xim --replace


##################################################
# パス
##################################################
GOROOT=$HOME/go
PATH=$PATH:$GOROOT/bin
